module.exports = {
    Tips: {
        Connect: 'コネクトBSCウォレット...',
        Error: '接続エラー',
        BrowserTips: 'DAPPブラウザが必要',
        Wait: 'お待ちください...',
        Success:'成功',
        Load:'ローディング......',
        MoreAmount:'数値は0以上であること',
        MoreUsdt:'金額はUSDTの残高を超えないように',
        Failed:'ウォレットへの接続に失敗しました、現在の口座残高を確認してください',
        Tip1:'この操作では',
        Tip2:'USDTをスマートコントラクトに',
        WaitConnect:'"確認を待って、ハッシュは：です"',
        ConfirmingTips:'確定申告？',
        Yes:'はい',
        No:'いいえ',
        Fail:'失敗',
        WiFail:'現金引き出しの失敗',
        Copyed:'Copyed..',
        SelectTip:'通貨の選択',
        RefTips:'招待状へのリンクは、推薦者にお尋ねください。',
    },
    team:{
        L1:'L1部下の数:',
        TotalL1:'L1預金の合計額:',
        PowerBonus:'ボーナス要因の追加:',
        L2:'L2預金の合計額:',
        TotalL2:'L2預金の合計額:',
        agentTitle:'エージェントの統計情報:',
        agent1:'チームの総預金額：',
        agent2:'チームの総辞退数：',
        agent3:'チーム合計での受賞：',
        agent4:'パフォーマンス：',
     },
    home: {
        Nav1: 'ファーム',   
       Nav2: 'ルール',   
       Nav3: 'シェア',   
       Nav4: '還元率',   
       Nav5: 'チーム',    

       Apy:'デイリーリターン',
       TotalDeposit: 'USDTでの総預入額',
       USDTBalance: 'USDT余剰資金',
       FtDeposit: 'FT余剰資金',   
       Stake: 'ステーキング',   
       Title: 'Farmer のステーキング',   
       HomeTitle: 'USDTをマイニングする USDTまたはFarmer Tokenで',   
       PageTitle1: '流動性の紹介',   
       PageTitle2: 'アグリゲーターの紹介',   
       FeeTips:'3ヶ月以内の脱退手数料10',
       Balance:'WALLET BALANCE',
       Copy:'コピーアドレス',
       
       Stake:'ステークホルダー',
       Deposit:'デポジット',
       Withdraw:'現金引き出',
       Earned:'獲得',
    },
    view:{
        page1Title:'イールド・ファーミングの紹介',
        page1Content1:"イールドファーミング』とは？これは、AMM（Automatic Market Maker）の概念から始まります。一般的な伝統では、暗号通貨を株式や取引所で取引する場合、ほとんどが『コーミングシステム』を採用しています。つまり、A株を50ドルで売りたい場合、誰かが50ドルで買いたいと思わないと、取引が「正常に結合」して完了しないのです。"
        ,page1Content2:" 50ドルを使ってA株を買ってくれる人がいなければ、あなたの取引は成立しません。このような状況が頻繁に起こる場合、「流動性の低下」と呼びます。取引が完了するまでに時間がかかるため、お客様の取引体験も悪くなることは当然と考えられています。"
        ,page1Content3:" そこで、このような事態を避けるために、株式や取引所の「取引相手」の役割に特化したマーケットメイカーという機関が存在する。あなたが売りたければ彼が買い、あなたが買いたければ彼が売ることで、取引の「流動性」を高め、「うまく混ぜる」ことができます。取引をスムーズにし、取引時間を短縮し、体験を向上させます。"
        ,page1Content4:" しかし、DeFiでは一般的に、個人やチームが運営する「マーケットメーカー」のような役割はありません。それを補うためには、従来のマーケットメーカーをAMM（Automated Market Maker）に置き換えて、各Dapp（Decentralized Application）の流動性を維持し、取引率を高め、顧客体験を向上させることが必要です。"
        ,page1Content5:" では、AMMは誰なのか？一言で言えば、お金に余裕のある人なら誰でもできます。余裕資金を特定のDappに預けるだけで、AMMのメンテナンスの役割を担い、利益を上げることができます。この行動を「Yield Farming」と呼びます。"
        ,page1Content6:" 分散型取引所（Dex）の場合、AMMでは、ユーザーが予備資金のトレーディングペア（BTC/USDT、ETH/USDT）を一定の割合で2つのプールに預け、「流動性」を提供する必要があります。つまり、他のユーザーがトレーディングペアを売買したいと思ったときに、売買できる暗号通貨があるということです。"
        ,page1Content7:"分散型取引所が買い手と売り手に請求した取引手数料は、一定の割合で「流動性提供者」にフィードバックされる仕組み、つまり、資金がプールに預けられたユーザーは、報酬を得ることができるのです。このようにして、すべてのユーザーが自分のトークンを流動性プールに投入することで、小さなマーケットメーカーとなり、取引手数料の配当を享受することができるのです。このような仕組みは、ローン契約と取引所の両方に存在しており、結果としてDeFiの活発な発展をもたらしています。"
        
        ,page2Title:'アグリゲーターの紹介'
        ,page2Content1:'DeFiのリクイディティマイニングはローリスクで比較的ハイリターンですが、同じ取引ペアでも、レンディング契約とDexでは利益配分が異なり、ユーザー数やDappの利益配分の仕組みによって、毎日、あるいは1時間単位で変動します。 さらに、貸出契約書やデクスの種類も多く、投資家にとっては混乱の元となっています。'
        ,page2Content2:'同じ暗号通貨（BTC、USDT、ETH、USDT）を使った「流動性マイニング」で最大の投資収益を得るためには、これらのメッセージに目を光らせていなければならず、資金の出し入れの複雑さには耐えられません。'
        ,page2Content3:'もう一つのDeFiのイノベーションとして登場したのが「アグリゲーター」です。 Aggregatorをファンドマネージャーとして想像してみてください。市場にある何千もの「銘柄」（DeFiスペースの様々なDapps）を持っていて、市場での投資収益率が最も高いポートフォリオの選択を自動的にサポートしてくれます（DeFiでは自動的に資金を配分します。 "lending"、"liquidity mining "などのDappプロジェクトで高額な報酬を得ることができます）。)'
        ,page2Content4:'USDT/USDCなどのコインで手持ちの資金があれば、アグリゲーターでそのコインを選択して資金を投入するだけで（正確には、アグリゲーターでそのコインの「マシンガンプール」、例えばUSDCのマシンガンプールなど）、利益が転がり込んでくるのを見ることができます。'
        ,page2Content5:'投資家は、主要なDappsの利回り比較を調査することに加え、ブロックチェーンへの資金の出し入れにかかる費用（Gas Fee：ブロックチェーン上のコントラクトへのアクセスや資金移動のためにマイナーに支払われる手数料）を節約することができます。アグリゲーターの出現により、ワンクリック投資はもはや夢物語ではありません。'

        
        ,rule1title:'Uユーザーの預金。'
        ,rulecontent1:'オプション1: '
        ,rulecontent2:'USDTをあなたのウォレットアドレスに直接入金します。'
        ,rulecontent3:'オプション 2:'
        ,rulecontent4:'FarmerToken（自然発生的な農業用トークン、USDTと1対1で一定）。'
        ,rulecontent5:'ユーザーがチャンネルを使って入金した場合、FarmerTokenはUSDT価格に比例して分配されます。'
        ,rulecontent6:'報酬制度です。'
        ,rulecontent7:'静的利益：1日あたり1.8% USDT増加し、各ブロックリリースに均等に分配されます。'
        ,rulecontent8:'ダイレクトプロモーション報酬：1日あたりのオフライン誓約額の0.14% USDTが増加し、各ブロックに均等に分配されます。インダイレクトプロモーション報酬：1日あたりのオフライン誓約額の0.06% USDTが増加し、各ブロックに均等に分配されます。'
        ,rulecontent9:'ユーザーの出金。'
        ,rulecontent10:'収穫：利益はいつでも引き出すことができます。引き出し：90日以内であれば、元本の引き出しには10％の管理手数料がかかります。'
        ,rulecontent11:'90日以降は、元本の引き出しにかかる管理費はかかりません。'
        ,rulecontent12:'ユーザーがUSDTまたはFarm Tokenで誓約した場合でも、ユーザーは収穫または引き出しの際にUSDTを受け取ることになります。'
    
    
    
    }
}